parmarjh/AR-Boards/boards.txt
menu.UploadSpeed=Upload Speed
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM

##############################################################

KarakuriV1.name=Karakuri V1

KarakuriV1.upload.tool=esptool
KarakuriV1.upload.maximum_size=1310720
KarakuriV1.upload.maximum_data_size=327680
KarakuriV1.upload.wait_for_upload_port=true

KarakuriV1.serial.disableDTR=true
KarakuriV1.serial.disableRTS=true

KarakuriV1.build.mcu=KarakuriV1
KarakuriV1.build.core=KarakuriV1
KarakuriV1.build.variant=KarakuriV1
KarakuriV1.build.board=KarakuriV1_DEV

KarakuriV1.build.f_cpu=240000000L
KarakuriV1.build.flash_size=4MB
KarakuriV1.build.flash_freq=40m
KarakuriV1.build.flash_mode=dio
KarakuriV1.build.boot=dio
KarakuriV1.build.partitions=default
KarakuriV1.build.defines=

KarakuriV1.menu.PSRAM.disabled=Disabled
KarakuriV1.menu.PSRAM.disabled.build.defines=
KarakuriV1.menu.PSRAM.enabled=Enabled
KarakuriV1.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-KarakuriV1-psram-cache-issue

KarakuriV1.menu.PartitionScheme.default=Default
KarakuriV1.menu.PartitionScheme.default.build.partitions=default
KarakuriV1.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
KarakuriV1.menu.PartitionScheme.minimal.build.partitions=minimal
KarakuriV1.menu.PartitionScheme.no_ota=No OTA (Large APP)
KarakuriV1.menu.PartitionScheme.no_ota.build.partitions=no_ota
KarakuriV1.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
KarakuriV1.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
KarakuriV1.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
KarakuriV1.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

KarakuriV1.menu.FlashMode.qio=QIO
KarakuriV1.menu.FlashMode.qio.build.flash_mode=dio
KarakuriV1.menu.FlashMode.qio.build.boot=qio
KarakuriV1.menu.FlashMode.dio=DIO
KarakuriV1.menu.FlashMode.dio.build.flash_mode=dio
KarakuriV1.menu.FlashMode.dio.build.boot=dio
KarakuriV1.menu.FlashMode.qout=QOUT
KarakuriV1.menu.FlashMode.qout.build.flash_mode=dout
KarakuriV1.menu.FlashMode.qout.build.boot=qout
KarakuriV1.menu.FlashMode.dout=DOUT
KarakuriV1.menu.FlashMode.dout.build.flash_mode=dout
KarakuriV1.menu.FlashMode.dout.build.boot=dout

KarakuriV1.menu.FlashFreq.80=80MHz
KarakuriV1.menu.FlashFreq.80.build.flash_freq=80m
KarakuriV1.menu.FlashFreq.40=40MHz
KarakuriV1.menu.FlashFreq.40.build.flash_freq=40m

KarakuriV1.menu.FlashSize.4M=4MB (32Mb)
KarakuriV1.menu.FlashSize.4M.build.flash_size=4MB
KarakuriV1.menu.FlashSize.2M=2MB (16Mb)
KarakuriV1.menu.FlashSize.2M.build.flash_size=2MB
KarakuriV1.menu.FlashSize.2M.build.partitions=minimal

KarakuriV1.menu.UploadSpeed.921600=921600
KarakuriV1.menu.UploadSpeed.921600.upload.speed=921600
KarakuriV1.menu.UploadSpeed.115200=115200
KarakuriV1.menu.UploadSpeed.115200.upload.speed=115200
KarakuriV1.menu.UploadSpeed.256000.windows=256000
KarakuriV1.menu.UploadSpeed.256000.upload.speed=256000
KarakuriV1.menu.UploadSpeed.230400.windows.upload.speed=256000
KarakuriV1.menu.UploadSpeed.230400=230400
KarakuriV1.menu.UploadSpeed.230400.upload.speed=230400
KarakuriV1.menu.UploadSpeed.460800.linux=460800
KarakuriV1.menu.UploadSpeed.460800.macosx=460800
KarakuriV1.menu.UploadSpeed.460800.upload.speed=460800
KarakuriV1.menu.UploadSpeed.512000.windows=512000
KarakuriV1.menu.UploadSpeed.512000.upload.speed=512000

KarakuriV1.menu.DebugLevel.none=None
KarakuriV1.menu.DebugLevel.none.build.code_debug=0
KarakuriV1.menu.DebugLevel.error=Error
KarakuriV1.menu.DebugLevel.error.build.code_debug=1
KarakuriV1.menu.DebugLevel.warn=Warn
KarakuriV1.menu.DebugLevel.warn.build.code_debug=2
KarakuriV1.menu.DebugLevel.info=Info
KarakuriV1.menu.DebugLevel.info.build.code_debug=3
KarakuriV1.menu.DebugLevel.debug=Debug
KarakuriV1.menu.DebugLevel.debug.build.code_debug=4
KarakuriV1.menu.DebugLevel.verbose=Verbose
KarakuriV1.menu.DebugLevel.verbose.build.code_debug=5
